Revit 2024 API
FabricationPart.IsAStraight Method
 Checks whether it is a straight part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsAStraight()
Visual Basic
Public Function IsAStraight As Boolean
Visual C++
public:
bool IsAStraight()
Return Value
 True if the part is a straight part. False otherwise.
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace